[
	{
		"company": "PayPal",
		"position": "MTS 1, Information Security Engineer",
		"location": {
			"city": "Scottsdale",
			"state": "AZ"
		},
		"duration":{
			"begin": "2014-10-01",
			"end": "2015-02-25"
		},
		"beginDate": "2014-10-01",
		"endDate": "2015-02-25",
		"description": "Member of a specialized unit within the InfoSec group specializing in the field of Application Security. Focused on innovating and impementing secure applications using the best practices which fits the PayPal business environment. Working with an abundance of the latest technologies, as well as with many projects that are highly sensitive in nature requiring a high level of trust, values and integrity.",
		"accomplishments":[
			"Perform security assessments for web user interfaces, mobile applications, databases, point-of-sale systems, and back-end services.",
			"Manually verify salient findings from automated tools to lower the number of false positives.",
			"Respond to externally submitted security bugs.",
			"Validate potential security issues submitted externally",
			"Work with Third Party security assessment vendors by guiding, validating, and recommending evaluations.",
			"Track and drive issue remediation.",
			"Maintain knowledge of security and privacy laws, industry best practices, changes in technology, and advise on the impact for PayPal Collaborate on solutions to mitigate risks and enhance system security.",
			"Assist in security process improvement initiatives.",
			"Assist external auditors, regulatory auditors and other 3rd parties as needed.",
			"Assist in company-wide security initiatives.",
			"Participate in the evaluation and recommendation of new and emerging security products and technologies.",
			"Participate in mentoring activities for junior members of the team.",
			"Participate in security compliance efforts (e.g., PCI-DSS, SOX, ISO).",
			"Participate in security incident handling."
		],
		"environment":[
			"RHEL 5 & 6", "PowerBroker", "Apache", "MySQL", "Guardium"
		],
		"misc": {
			"note":""
		}
	},
	{
		"company": "LifeLock",
		"position": "Infrastructure Engineer II",
		"location": {
			"city": "Tempe",
			"state": "AZ"
		},
		"duration":{
			"begin": "2011-05-02",
			"end": "2014-06-21"
		},
		"beginDate": "2011-05-02",
		"endDate": "2014-06-21",
		"description": "Responsible for developing, configuring, installing and maintaining technology in a multi-platform mission critical environment. Daily system maintenance tasks and participated in an on-call rotation. Largely focused on automating Linux related tasks, such as new server provisioning and decommissioning, RHDS/LDAP account management, SOX and PCI/DSS audits, custom Nagios checks, S.A.M. Server Population, etc. As well as published documentation to aid in common daily tasks, train new hires and interview potential candidates for other Linux roles.",
		"accomplishments":[
			"Developed an application used to inventory LifeLock's servers, storing and maintaining details such as hostname, IP, OS, Kernel, Date Provisioned, applications, Moniotring level, etc.",
			"Created custom TCL iRules and Health Checks within the F5 Load Balancers for Linux applications.",
			"Setup and managed an enterprise version of Jenkins (Cloudbees) using LDAP Groups for permissions and the F5's for load balancing.",
			"Developed many scripts to parse and reconstruct batch files with new enrollments from partners and affiliates."
		],
		"environment":[
			"RHEL 4, 5 & 6", "CentOS 4, 5 & 6", "Spacewalk/Satellite", "Windows 2003 & 2008", "VMWare", "Jenkins/Hudson", "Bamboo", "Cloudbees", 
			"Chef", "Weblogic", "NoMachine", "Oracle Database", "MySQL", "RHDS", "Active Directory", "Nagios", "Apache", "Tomcat", "Atlassian Suite", 
			"Cacti", "Subversion", "NetApp", "Tripwire", "Big-IP F5 Load Balancers", "ServiceDesk", "Q-Radar", "Oracle Linux", "CA AutoSys", "IIS7", 
			"Nexpose", "SQLite", "IPPlan", "AWS"
		],
		"misc": {
			"note":""
		}
	},
	{
		"company": "JAWA/Cylon LLC",
		"position": "NOC Analyst / Linux Administrator",
		"location": {
			"city": "Scottsdale",
			"state": "AZ"
		},
		"duration":{
			"begin": "2010-09-10",
			"end": "2011-05-06"
		},
		"beginDate": "2010-09-10",
		"endDate": "2011-05-06",
		"description": "Initially employed into the 24/7 NOC, working with a small team of System Analysts in charge of monitoring JAWA’s infrastructure and maintaining a 99.9% network uptime. Worked on special tasks such as handling escalated tickets, automating daily tasks, automating the NOCs desktop provisioning (Ubuntu), etc. Quickly promoted to the Linux Admin role within a matter of months. Started working more with Nagios, assisting in the automated provisioning of new servers, managing Jenkins, creating tools to help the NOC and other administrators in day to day tasks. Was also part of an on-call rotation as an escalation point for issues within the NOC.",
		"accomplishments":[
			"Created scripts to complete tasks that were presently done manually, such as parsing logs, updating tickets, etc.",
			"Managed and upgraded the installation of Jenkins, as well as migrating various scripts to new Jenkins jobs.",
			"Automated the population of nagios from a list of websites and servers kept in various locations.",
			"Created much documentation to assist the new hires in troubleshooting common issues and setting up new production servers."
		],
		"environment":[
			"RHEL 5", "CentOS 5", "Apache", "Tomcat", "MySQL5", "RHDS", "BackupPC", "Nagios", "Oracle VirtualBox", "VMWare", "Jenkins/Hudson"
		],
		"misc": {
			"note": "JAWA (Cylon) LLC Is no longer a fully operational company. For verification of employment or employee records, please contact me directly."
		}
	},
	{
		"company": "CrystalTech / NewTek",
		"position": "Technical Support & System Administrator",
		"location": {
			"city": "Phoenix",
			"state": "AZ"
		},
		"duration":{
			"begin": "2009-04-10",
			"end": "2010-09-06"
		},
		"beginDate": "2009-04-10",
		"endDate": "2010-09-06",
		"description": "Provided technical support for customers via phone, chat and tickets, on shared Windows environments, as well as dedicated Linux and Windows servers. Linux related support on dedicated servers including tasks such as basic setup and management of a LAMP environment, troubleshooting and diagnosing compromised servers, troubleshooting issues within the customers code (Usually PHP) and anything else requested within the dedicated support package.",
		"accomplishments":[
			"Managed a large environment of shared, semi-dedicated and dedicated hosting servers (Around ~2k physical servers & ~1.5k virtual.)",
			"Supported developers with code related issues in many different languages (PHP, Perl, ASP, ASP.NET, ColdFusion, etc.)",
			"Showed customers how to install and maintain websites using different Content Management Systems, (ZenCart, Opencart, PrestaShop, Wordpress, Drupal, Joomla, DNN etc.)",
			"Educated customers paying for premium support on Linux Dedicated servers how to setup and manage a basic LAMP Stack server.",
			"Acted as the lead web developer for smaller clients paying for premium web development support."
		],
		"environment":[
			"CentOS5", "Ubuntu Server", "Windows 2003 & 2008", "IIS6 & 7", "SmarterTools Products", "Comvault"
		],
		"misc": {
			"note":""
		}
	},
	{
		"company": "AmpHosted",
		"position": "Business Owner",
		"location": {
			"city": "Phoenix",
			"state": "AZ"
		},
		"duration":{
			"begin": "2008-08-15",
			"end": "2010-12-03"
		},
		"beginDate": "2008-08-15",
		"endDate": "2010-12-03",
		"description": "Purchased a dedicated server, occupied by as little as 10 clients and websites, and then migrated the websites to a different data center on a different and more powerful server. Eventually outgrew the environment, and found it necessary to spread the load onto multiple servers in different data centers for geographical reasons. Upon managing the servers and supporting the customers (roughly 200 customers), the following skills were acquired: cPanel/WHM, Bind, Named, Perl scripting, PHP scripting, MySQL management, advanced Apache/cPanel server optimization, troubleshooting errors for customers, deploying new applications on production servers with minimal downtime, full server backups, new account automation and creation, cPanel/WHM API/API2, and much more.",
		"accomplishments":[
			"Leased and managed multiple dedicated servers from multiple data centers such as Softlayer, The Planet, and FDCservers.",
			"Setup the hosting environment on multiple servers (All Linux based, such as RHEL4, RHEL5, Centos5, and Ubuntu.)",
			"Setup and managed cPanel/WHM. Most management was done via custom perl scripts used to execute scripts and commands on multiple servers.",
			"Dealt with customers on a first hand basis to troubleshoot various issues such as FTP, Mail (Webmail and Outlook), Frontpage, code issues, server based issues, etc.",
			"Managed disaster-recovery planning and execution on multiple occasions."
		],
		"environment":[
			"CentOS 5", "RHEL 5", "WHM/cPanel", "BackupPC", "MySQL 5"
		],
		"misc": {
			"note": "AmpHosted is no longer an existing business, however, it can be verified from past customers and administrators."
		}
	}
]